Revit 2026 API

# IndependentTagTagOrientation Property

---

The tag orientation of the tag's head, such as horizontal or vertical.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TagOrientation TagOrientation { get; set; }
```
```vb
Public Property TagOrientation As TagOrientation
	Get
	Set
```
```cpp
public:
property TagOrientation TagOrientation {
	TagOrientation get ();
	void set (TagOrientation value);
}
```
```fsharp
member TagOrientation : TagOrientation with get, set
```

#### Property Value

TagOrientation

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

TagOrientation for the supported orientations. Tags from types that have rotate with component turned on ignore the TagOrientation property. Tags that are not in tag mode ignores the TagOrientation property.

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace